// let age = prompt('Скільки вам років?', 100);

// alert(`Вам ${age} років!`);

// let isBoss = confirm("Ви бос?");

// alert( isBoss );



// Додавання +,
// Віднімання -,
// Множення *,
// Ділення /,
// Остача від ділення %,
// Піднесення до степеня **.

// AND(і) ( & )
// OR(або) ( | )
// XOR(побітове виключне або) ( ^ )
// NOT(ні) ( ~ )
// LEFT SHIFT(зсув ліворуч) ( << )
// RIGHT SHIFT(зсув праворуч) ( >> )
// ZERO-FILL RIGHT SHIFT(зсув праворуч із заповненням нулями) ( >>> )

// У JavaScript є 8 основних типів.

// Сім примітивних типів даних:

// number для будь-яких чисел: цілих або з рухомою точкою. Цілі числа обмежені до ±(253-1).
// bigint для цілих чисел довільної довжини.
// string для рядків. Рядок може мати нуль або більше символів, немає окремого типу для одного символу.
// boolean для true/false.
// null для невідомих значень – автономний тип, який має єдине значення null.
// undefined для не присвоєних значень – автономний тип, який має єдине значення undefined.
// symbol для унікальних ідентифікаторів.
// І один непримітивний тип даних:

// object для складних структур даних.


// typeof undefined // "undefined"

// typeof 0 // "number"

// typeof 10n // "bigint"

// typeof true // "boolean"

// typeof "foo" // "string"

// typeof Symbol("id") // "symbol"

// typeof Math // "object"  (1)

// typeof null // "object"  (2)

// typeof alert // "function"  (3)